import React from "react";
import styles from "./SecondBlock.module.css"
import phone from "./phoneWithApp.png"

const SecondBlock = () => {
    return (
        <>
            <div className={styles.line_block}>
                    <svg xmlns="http://www.w3.org/2000/svg" className={styles.line} viewBox="0 0 1362 37" fill="none">
                        <path d="M1 36L188 1H1151L1361 36" stroke="#8A2C30"/>
                    </svg>
            </div>
            <div style={{ display: "flex", flexDirection: "column", gap: "4rem" }}>
                <div className={styles.part}>
                    <div className={styles.text_block}>
                        <h1 className={styles.title_elem}>МОБИЛЬНОЕ ПРИЛОЖЕНИЕ</h1>
                        <p className={styles.p}>Безграничная страсть к страйкболу и стремление к улучшению игрового опыта, привели нас к созданию инновационной системы для проведения страйкбольных игр с возможностью верификации и дистанционного отслеживания статистики.</p>
                    </div>
                    <div className={styles.card_img_block}>
                        <svg className={styles.card}  xmlns="http://www.w3.org/2000/svg" width="233" height="233" viewBox="0 0 233 233" fill="none">
                            <rect x="2.5" y="2.5" width="228" height="228" rx="27.5" stroke="#FF5550" stroke-width="5"/>
                            <path d="M32.7018 113.526V96.4165H40.2227V103.847L50.451 96.4165H60.7797L51.3786 103.236L65.5429 113.526H55.2142L46.2143 107L40.2227 111.351V113.526H32.7018Z" fill="#FF5550"/>
                            <path d="M66.0218 113.526V96.4165H73.5426V106.976L88.0579 96.4165H97.108V113.526H89.5872V102.796L74.8212 113.526H66.0218Z" fill="#FF5550"/>
                            <path d="M127.47 102.527C128.656 102.527 129.642 102.804 130.428 103.358C131.213 103.896 131.798 104.572 132.183 105.387C132.584 106.202 132.784 107.082 132.784 108.027C132.784 108.972 132.584 109.852 132.183 110.667C131.798 111.481 131.213 112.166 130.428 112.72C129.642 113.258 128.656 113.526 127.47 113.526H100.394V96.4165H130.979V101.305H107.915V102.527H127.47ZM107.915 107.416V108.638H125.263C125.497 108.638 125.673 108.573 125.79 108.442C125.907 108.312 125.965 108.174 125.965 108.027C125.965 107.88 125.907 107.742 125.79 107.611C125.673 107.481 125.497 107.416 125.263 107.416H107.915Z" fill="#FF5550"/>
                            <path d="M141.578 108.638H163.639V113.526H134.057V96.4165H162.386V101.305H141.578V102.527H158.876V107.416H141.578V108.638Z" fill="#FF5550"/>
                            <path d="M173.919 107.416V113.526H166.398V96.4165H192.571C193.958 96.4165 195.111 96.6935 196.03 97.2476C196.966 97.7853 197.668 98.4616 198.136 99.2763C198.604 100.091 198.838 100.971 198.838 101.916C198.838 102.861 198.604 103.741 198.136 104.556C197.668 105.371 196.966 106.055 196.03 106.609C195.111 107.147 193.958 107.416 192.571 107.416H173.919ZM191.543 102.527C191.743 102.527 191.894 102.462 191.994 102.332C192.094 102.201 192.144 102.063 192.144 101.916C192.144 101.769 192.094 101.631 191.994 101.501C191.894 101.37 191.743 101.305 191.543 101.305H173.919V102.527H191.543Z" fill="#FF5550"/>
                            <path d="M32.7018 137.969V118.415H41.2603V132.382H52.2437V118.415H60.8022V132.382H71.7856V118.415H80.3441V137.969H32.7018Z" fill="#FF5550"/>
                            <path d="M98.0395 124.002H83.49V118.415H121.147V124.002H106.598V137.969H98.0395V124.002Z" fill="#FF5550"/>
                            <path d="M146.686 130.986H131.708L127.572 137.969H117.73L129.226 118.415H149.139L160.636 137.969H150.794L146.686 130.986ZM143.377 125.399L142.549 124.002H135.817L134.989 125.399H143.377Z" fill="#FF5550"/>
                            <path d="M192.865 125.399C194.215 125.399 195.337 125.715 196.231 126.348C197.125 126.963 197.791 127.736 198.228 128.667C198.685 129.598 198.913 130.604 198.913 131.684C198.913 132.764 198.685 133.77 198.228 134.701C197.791 135.632 197.125 136.414 196.231 137.047C195.337 137.662 194.215 137.969 192.865 137.969H162.054V118.415H196.859V124.002H170.613V125.399H192.865ZM170.613 130.986V132.382H190.354C190.621 132.382 190.82 132.308 190.954 132.159C191.087 132.01 191.153 131.852 191.153 131.684C191.153 131.516 191.087 131.358 190.954 131.209C190.82 131.06 190.621 130.986 190.354 130.986H170.613Z" fill="#FF5550"/>
                        </svg>
                    </div>
                </div>
                <div className={styles.part}>
                    <div className={styles.card_img_block}>
                       <img src={phone} alt="" className={styles.card}/>
                    </div>
                    <div className={styles.text_block}>
                        <h1 className={styles.title_elem}>ВСЯ ИНФОРМАЦИЯ В УСТРОЙСТВЕ</h1>
                        <p className={styles.p}>Безграничная страсть к страйкболу и стремление к улучшению игрового опыта, привели нас к созданию инновационной системы для проведения страйкбольных игр с возможностью верификации и дистанционного отслеживания статистики.</p>
                    </div>
                    
                </div>
            </div>
            <div className={styles.line_block}>
                    <svg xmlns="http://www.w3.org/2000/svg" className={styles.line_bottom} viewBox="0 0 1362 37" fill="none">
                        <path d="M1 36L188 1H1151L1361 36" stroke="#8A2C30"/>
                    </svg>
            </div>
        </>
    )
}

export default SecondBlock;